        03 LIB1-I.
           05  LIB1-I-KEY                      PIC  X(005).
        03 LIB1-O.
           05  LIB1-O-ERR                      PIC  X(005).
           05  LIB1-O-DATA                     PIC  X(080).
